{
    "Questions": [
        {
            "question": "My girlfriend just told me she’s pregnant. We’ve only been dating two months and I don’t know what to do",
            "userName": "User",
            "responses": [
                {
                    "author": "Expert 1",
                    "content": "Hey - it sounds like you might be a little unsure what to do - that’s totally ok. The first step would be to confirm your girlfriend is indeed pregnant. Has she taken a pregnancy test already? "
                },
                {
                    "author": "User",
                    "content": "No she hasn’t but her period is late and it’s never late she says so we’re both really worried."
                },
                {
                    "author": "Expert 1",
                    "content": "It’s totally scary to have a late period but periods can be late for other reasons besides pregnancy like stress or medication or sometimes they just are. It’s definitely a good idea for her to take a pregnancy test. Do you know where to get one and how to take it? "
                },
                {
                    "author": "User",
                    "content": "oh ok, I didn’t know that at all. I’ll make sure she takes a test. Thank you. "
                },
                {
                    "author": "User",
                    "content": "No problem at all. Feel free to check back in with us and let us know what happens either way. "
                }
            ]
        },
        {
            "question": "Sometimes I noticed cervical pain around sex. Is there anything this relies on and is there anything I can do to prevent or reduce it? ",
            "userName": "User 2",
            "responses": [
                {
                    "author": "Expert 1",
                    "content": "I’m so sorry you’re having pain around sex - that’s never fun. Many people have a cervix that’s sensitive and penetration can sometimes be painful if it’s deep enough or in a specific position. If there are any positions you’ve noticed that tend to be more painful, you can avoid those. Have you noticed any patterns?"
                },
                {
                    "author": "User 2",
                    "content": "Yeah, it’s definitely in certain positions that it hurts more but I also really like those positions. Do I have to give them up?"
                },
                {
                    "author": "Expert 2",
                    "content": "Not at all! But you do need to have shallower thrusting. Your partner can put a couple of fingers around the base of their penis or dildo so that they aren’t thrusting as deeply. That should help reduce the pain you’re feeling. The other thing to know is that the vagina sort of expands and gets bigger during arousal - so the more aroused you are, the more the cervix will be a bit farther up into your body."
                },
                {
                    "author": "User 2",
                    "content": "Ok, I’ll try both of those things!"
                }
            ]
        },
        {
            "question": "Is it bad if my period lasts longer than the typical 3-5 days? ",
            "userName": "User 3",
            "responses": [
                {
                    "author": "Expert 1",
                    "content": "That’s a great question. Do you mean one time or every time? "
                },
                {
                    "author": "User 3",
                    "content": "Every time"
                },
                {
                    "author": "Expert 1",
                    "content": "It’s totally normal for periods to be longer than 3-5 days, sometimes 7-8 can happen. It can be really different from person to person and some people even experience different lengths from month to month. As much as we might want them to be, bodies are not super exact like that. "
                },
                {
                    "author": "User 3",
                    "content": "ok - mine are usually like 8 days and I thought maybe there was something wrong with me but you’re saying it’s totally normal?"
                },
                {
                    "author": "Expert 2",
                    "content": "It’s definitely annoying to have a period that long but it is normal. Do you have really heavy bleeding during that whole time?"
                },
                {
                    "author": "User 3",
                    "content": "No, I think it’s pretty normal - it’s not annoying or anything"
                },
                {
                    "author": "Expert 1",
                    "content": "ok, then it sounds like things are pretty normal, you just have a longer flow. (smiley emoji)"
                },
                {
                    "author": "User 3",
                    "content": "ok thank you."
                }
            ]
        },
        {
            "question": "How do you love yourself?",
            "userName": "User 4",
            "responses": [
                {
                    "author": "Expert 1",
                    "content": "Thanks for reaching out. One thing I think it’s helpful to remember is that often we find it hard to love ourselves when we compare ourselves to other people. But the thing about comparing ourselves to other people is that it’s not a fair comparison. We rarely see the “real” person. We see what they chose to put forward for the world - their “greatest hits”. But here we are knowing all our “behind the scenes” and thinking we don’t measure up. So, one of the first places to start is to try to remember this and really take it in, because when we realize that everyone has things they don’t like and everyone is weird and everyone is awesome and everyone is working on stuff, it becomes a lot easier to know that we are great, just the way we are."
                }
            ]
        },
        {
            "question": "I’ve kissed before, but only when I’ve been under the influence. It scares me to death to think about anything intimate and I don’t know how to get over it. ",
            "userName": "User 5",
            "responses": [
                {
                    "author": "Expert 1",
                    "content": "I’m sorry you’re feeling this way. Let me assure you - everyone moves at their own pace and whatever pace you’re at is the right one. It’s important that we listen to ourselves and no one else - you’re doing the right things. I know it can seem like you’re missing out on something but this phenomenon of have done/have not done stops once you reach a certain age. Eventually, no one cares or compares. Does that make sense?"
                },
                {
                    "author": "User 5",
                    "content": "That does make sense, thank you."
                },
                {
                    "author": "Expert 1",
                    "content": "You’re welcome. We’ve all been there - you are not alone"
                }
            ]
        },
        {
            "question": "I’m having difficulty orgasming. Lack of arousal is not the issue. I’m aroused but I’m just not getting there. We’ve gotten there once but I know it bugs my partner a bit that he can’t get me there. ",
            "userName": "User 6",
            "responses": [
                {
                    "author": "Expert 1",
                    "content": "Hi there - thank you so much for writing in. I actually doe have a couple more questions if you don’t mind answering them:Are you trying to orgasm from vaginal penetration? Clitoral stimulation? Do you masturbate? If so can you orgasm that way? Would you consider using sex toys? "
                },
                {
                    "author": "User 6",
                    "content": ""
                },
                {
                    "author": "User 6",
                    "content": "Both. Not really and no. We have discussed toys. When we’re having sex I get these sort of “minigasms” that get more intense the more aroused I am but I don’t get all hte way. Also when I’ve tried to masturbate I don’t really find it pleasurable. And I’ve just done it until I get that first “minigasm”"
                },
                {
                    "author": "Expert 1",
                    "content": "do you find any difference between clitoral and vaginal stimulation? The clit is generally the go to place for pleasure but it also has to be treated in the proper way or it won’t be very pleasurable. We can talk through that if you’d like. I would definitely think about getting a vibrator and seeing how that changes things. Also just generally focusing on clit simulation as much as possible."
                },
                {
                    "author": "User 6",
                    "content": "He has done manual clit stimulation during  penetration and by itself and is careful to use plenty of lube. When I’m getting close it tends to get really sensitive and painful though. And I feel like I need to cry."
                },
                {
                    "author": "Expert 1",
                    "content": "Hmm ok that’s really helpful because generally as we’re getting more and more aroused the clit does not feel painful but then afterwards it does and we can feel like we’re going to cry afterwards. I’m wondering if “close” is actually after an orgasm - do you think that could be? "
                },
                {
                    "author": "User 6",
                    "content": "No because I don’t get that satisfied feeling until i go over the edge. And feeling like I need to cry is from an emotional standpoint. "
                },
                {
                    "author": "Expert 2",
                    "content": "Just to jump in - maybe direct clit stimulation is too intense - you might want to try to the side or just above. And I wonder if the feeling of needing to cry is holding you back from having an orgasm? "
                },
                {
                    "author": "User 6",
                    "content": "Feeling like I need to cry may actually be contributing to that. Maybe I’m holding myself back from orgasm. I’ll try to let myself go a bit and try some of those other areas. Thank you."
                }
            ]
        },
        {
            "question": "I have a dilemma. I really like someone I work with but I don't know if she might be interested in me. We used to talk a lot but now she barely acknowledges me. What should I do? ",
            "userName": "User 7",
            "responses": [
                {
                    "author": "Expert 1",
                    "content": "It sounds like maybe something is going on for her which may or may not have something to do with you. What about just checking in with her first and saying something like \"hey, I noticed that ________. Are you ok?\""
                },
                {
                    "author": "User 7",
                    "content": "Oh I didn't think about it that way, thank you so much!"
                },
                {
                    "author": "Expert 1",
                    "content": "You're welcome, let us know how it goes!"
                },
                {
                    "author": "User 7",
                    "content": "Wow, you were 100% spot on. She was going through something and told me it was lightening up thank you. I invited her to go to the gym with me when she's available. I hope that wasn't a step too far? "
                },
                {
                    "author": "Expert 1",
                    "content": "I'm so glad to hear that! I bet she really appreciated you noticing and checking in. And I don't think that's too far. If you end up going together, you can feel things out and see if she needs space or if she's into you"
                }
            ]
        },
        {
            "question": "How do you know when you break off a relationship?",
            "userName": "User 8",
            "responses": [
                {
                    "author": "Expert 1",
                    "content": "Ultimately only you can really decide that. Some guidelines are to consider how loved and cared for you feel, if there are things that need to change, and how willing both of you are to make those changes. Is there a particular situation happening that you'd like to talk about?"
                },
                {
                    "author": "User 8",
                    "content": "Yes my mother is verbally abusive and unreliable"
                },
                {
                    "author": "Expert 1",
                    "content": "I'm so sorry - that's really hard and unfair to you. I know it can feel hard to think about not having your mom in your life but it's also totally reasonable to not let someone who is that toxic into your life. What does you gut say?"
                },
                {
                    "author": "User 8",
                    "content": "I have blocked her. I just hope i'm doing the right thing."
                },
                {
                    "author": "Expert 1",
                    "content": "All you can do is the thing that feels right to you at the time and you have very good reasons for needing space from her."
                }
            ]
        },
        {
            "question": "What is the difference between small talk and flirting? ",
            "userName": "User",
            "responses": [
                {
                    "author": "Expert ",
                    "content": "Small talk is usually just that -meaningless chat to fill the time. Flirting is more intentional - jokes, eye contact, maybe a touch on the arm. Is there a particular situation you're wondering about?"
                },
                {
                    "author": "User ",
                    "content": "No, i've just been trying to grasp what the difference was but unable to tell"
                },
                {
                    "author": "Expert ",
                    "content": "It can be tricky sometimes. Generally small talk is the vibe you feel when talking to a family member or teacher. Flirting feels more exciting, like \"what's going to happen?\" and can have some kind of physical contact more than eye contact"
                },
                {
                    "author": "User ",
                    "content": "Hmm.. never though of it or seen it portrayed that way before"
                },
                {
                    "author": "Expert ",
                    "content": "Does it make sense? Sometimes it can be hard to tell the difference"
                },
                {
                    "author": "User ",
                    "content": "Yes it does help to make it more clear. Flirting sounds like you're more intersted and maybe being playful"
                },
                {
                    "author": "Expert ",
                    "content": "Exactly - that's a great way of putting it. "
                },
                {
                    "author": "Expert ",
                    "content": "So how do I tell hwen someone is flirting with me and not jsut being nice?"
                },
                {
                    "author": "Expert",
                    "content": "It depends on the person. Generally if htey find excuses to touch you that's a good sign. So is starting a conversation even if they have nothing in particular to say or making any kind of suggestive joke or comment. "
                },
                {
                    "author": "User",
                    "content": "Thanks a ton!"
                }
            ]
        },
        {
            "question": "My boyfriend has a lot of female friendships and I can't help but ot get jealous. I think I just need reassurance but I don't know how to get it",
            "userName": "User ",
            "responses": [
                {
                    "author": "Expert ",
                    "content": "I'm so glad you reached out. Have you talked to him about it?"
                },
                {
                    "author": "User ",
                    "content": "We've gotten into arguments because I've been insecure and thought he might have been cheating. He always tells me he would never lie to me. We also argue a lot - more than we should."
                },
                {
                    "author": "Expert ",
                    "content": "So it sounds like you're frustrated because you're having these feelings, and he's frustrated because he feels like you don't trust him. Is that right? Why do you think you argue more than you should?"
                },
                {
                    "author": "User ",
                    "content": "Exactly - and we argue a lot, like about nonesense. Sometimes every little thing sparks an argument."
                },
                {
                    "author": "Expert ",
                    "content": "Sometimes that can happen because one or both of you is unhappy with something - either in the relationship or another part of life. When you think about him and your relationship, how do you feel? Do you feel like he loves and respects you?Is there anything you wish were different?"
                },
                {
                    "author": "User",
                    "content": "I love him and i know he does too, I just want us to agree on things. He doesn't like to say he's wrong even when he knows that he is and I htink that it plays a big role in coming to an agreement or event fixing those arguments."
                },
                {
                    "author": "Expert ",
                    "content": "Ah, that would definitely play a part. Have you said anything to him abou tit? Sometimes we just need someone to say \"you can be vulnerable. I see that as a strength. I want you to do that\""
                },
                {
                    "author": "User ",
                    "content": "True, I'll do that. "
                }
            ]
        },
        {
            "question": "My boyfriend contineus to masturbate but won't have sex with me. When I bring up my concerns he says i'm focused on sex but i don't think I am, I just like it! ",
            "userName": "User ",
            "responses": [
                {
                    "author": "Expert ",
                    "content": "It sounds like maybe something is going on for him emotionally. Maybe somethign with health or work is affecting his desire. Masturbation is much easier and so it may feel better to him in the moment. Are there other ways you could be sexual with him that would work for you? Like maybe mutual masturbation? Are there ways you can be supportive of him at this time? "
                },
                {
                    "author": "User ",
                    "content": "I have been supportive, i don't know what else to do. I do everything in our relationship and i'm at my wits end"
                },
                {
                    "author": "Expert ",
                    "content": "That sounds really frustrating. What if you framed things in terms of what your needs are? Your needs might not be having sex exactly but might be needing to feel wanted or considered by him. Sometiems what we say is \"I want to have sex\" but what we need is something deeper. It's much harder to shut down another person's needs and it tends to lead to a deeper conversation about the relationship and what is happening. "
                },
                {
                    "author": "User ",
                    "content": "Yes I agree and I think that I've avoided having the conversation with him becuase of the issues he is dealing with."
                },
                {
                    "author": "Expert ",
                    "content": "That's understandable and at the same time, your needs deserve to have a place in the relationship too."
                }
            ]
        }
    ]
}